# Напишите программу, которая добавляет ‘ing’ к словам
word = ['read', 'meet', 'sing', 'eat', 'driv']
new_word= []
for element in word:
    new_word.append(element + 'ing')
print(new_word)
