# Напишите программу которая удаляет пробел в начале, в конце строки
kek = "    Заметался пожар голубой   "
print(kek.strip())
