"""
2. Напишите программу, которая добавляет ‘ing’ к словам
"""

some_word = 'test'
postfix = 'ing'
result = some_word + postfix

print(f'If we add "{postfix}" to "{some_word}", \
the result will be "{result}".')
