#Создайте список из 10 элементов, вставьте на 3-ю позицию новое значение,
# удалите элемент из списка под индексом 6
a = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10']
del a[6]
print(a)
